#+TITLE:Working with missing data
#+OPTIONS: toc:nil
* Introduction
#+BEGIN_SRC ipython :session :results table
import pandas as pd
f = "titanic_survival.csv"
titanic_survival = pd.read_csv(f)

#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session 
titanic_survival
#+END_SRC

#+RESULTS:
#+begin_example
     PassengerId  Survived  Pclass  \
0              1         0       3   
1              2         1       1   
2              3         1       3   
3              4         1       1   
4              5         0       3   
5              6         0       3   
6              7         0       1   
7              8         0       3   
8              9         1       3   
9             10         1       2   
10            11         1       3   
11            12         1       1   
12            13         0       3   
13            14         0       3   
14            15         0       3   
15            16         1       2   
16            17         0       3   
17            18         1       2   
18            19         0       3   
19            20         1       3   
20            21         0       2   
21            22         1       2   
22            23         1       3   
23            24         1       1   
24            25         0       3   
25            26         1       3   
26            27         0       3   
27            28         0       1   
28            29         1       3   
29            30         0       3   
..           ...       ...     ...   
861          862         0       2   
862          863         1       1   
863          864         0       3   
864          865         0       2   
865          866         1       2   
866          867         1       2   
867          868         0       1   
868          869         0       3   
869          870         1       3   
870          871         0       3   
871          872         1       1   
872          873         0       1   
873          874         0       3   
874          875         1       2   
875          876         1       3   
876          877         0       3   
877          878         0       3   
878          879         0       3   
879          880         1       1   
880          881         1       2   
881          882         0       3   
882          883         0       3   
883          884         0       2   
884          885         0       3   
885          886         0       3   
886          887         0       2   
887          888         1       1   
888          889         0       3   
889          890         1       1   
890          891         0       3   

                                                  Name     Sex  Age  SibSp  \
0                              Braund, Mr. Owen Harris    male   22      1   
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38      1   
2                               Heikkinen, Miss. Laina  female   26      0   
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35      1   
4                             Allen, Mr. William Henry    male   35      0   
5                                     Moran, Mr. James    male  NaN      0   
6                              McCarthy, Mr. Timothy J    male   54      0   
7                       Palsson, Master. Gosta Leonard    male    2      3   
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female   27      0   
9                  Nasser, Mrs. Nicholas (Adele Achem)  female   14      1   
10                     Sandstrom, Miss. Marguerite Rut  female    4      1   
11                            Bonnell, Miss. Elizabeth  female   58      0   
12                      Saundercock, Mr. William Henry    male   20      0   
13                         Andersson, Mr. Anders Johan    male   39      1   
14                Vestrom, Miss. Hulda Amanda Adolfina  female   14      0   
15                    Hewlett, Mrs. (Mary D Kingcome)   female   55      0   
16                                Rice, Master. Eugene    male    2      4   
17                        Williams, Mr. Charles Eugene    male  NaN      0   
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female   31      1   
19                             Masselmani, Mrs. Fatima  female  NaN      0   
20                                Fynney, Mr. Joseph J    male   35      0   
21                               Beesley, Mr. Lawrence    male   34      0   
22                         McGowan, Miss. Anna "Annie"  female   15      0   
23                        Sloper, Mr. William Thompson    male   28      0   
24                       Palsson, Miss. Torborg Danira  female    8      3   
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female   38      1   
26                             Emir, Mr. Farred Chehab    male  NaN      0   
27                      Fortune, Mr. Charles Alexander    male   19      3   
28                       O'Dwyer, Miss. Ellen "Nellie"  female  NaN      0   
29                                 Todoroff, Mr. Lalio    male  NaN      0   
..                                                 ...     ...  ...    ...   
861                        Giles, Mr. Frederick Edward    male   21      1   
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female   48      0   
863                  Sage, Miss. Dorothy Edith "Dolly"  female  NaN      8   
864                             Gill, Mr. John William    male   24      0   
865                           Bystrom, Mrs. (Karolina)  female   42      0   
866                       Duran y More, Miss. Asuncion  female   27      1   
867               Roebling, Mr. Washington Augustus II    male   31      0   
868                        van Melkebeke, Mr. Philemon    male  NaN      0   
869                    Johnson, Master. Harold Theodor    male    4      1   
870                                  Balkic, Mr. Cerin    male   26      0   
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female   47      1   
872                           Carlsson, Mr. Frans Olof    male   33      0   
873                        Vander Cruyssen, Mr. Victor    male   47      0   
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female   28      1   
875                   Najib, Miss. Adele Kiamie "Jane"  female   15      0   
876                      Gustafsson, Mr. Alfred Ossian    male   20      0   
877                               Petroff, Mr. Nedelio    male   19      0   
878                                 Laleff, Mr. Kristo    male  NaN      0   
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female   56      0   
880       Shelley, Mrs. William (Imanita Parrish Hall)  female   25      0   
881                                 Markun, Mr. Johann    male   33      0   
882                       Dahlberg, Miss. Gerda Ulrika  female   22      0   
883                      Banfield, Mr. Frederick James    male   28      0   
884                             Sutehall, Mr. Henry Jr    male   25      0   
885               Rice, Mrs. William (Margaret Norton)  female   39      0   
886                              Montvila, Rev. Juozas    male   27      0   
887                       Graham, Miss. Margaret Edith  female   19      0   
888           Johnston, Miss. Catherine Helen "Carrie"  female  NaN      1   
889                              Behr, Mr. Karl Howell    male   26      0   
890                                Dooley, Mr. Patrick    male   32      0   

     Parch            Ticket      Fare        Cabin Embarked  
0        0         A/5 21171    7.2500          NaN        S  
1        0          PC 17599   71.2833          C85        C  
2        0  STON/O2. 3101282    7.9250          NaN        S  
3        0            113803   53.1000         C123        S  
4        0            373450    8.0500          NaN        S  
5        0            330877    8.4583          NaN        Q  
6        0             17463   51.8625          E46        S  
7        1            349909   21.0750          NaN        S  
8        2            347742   11.1333          NaN        S  
9        0            237736   30.0708          NaN        C  
10       1           PP 9549   16.7000           G6        S  
11       0            113783   26.5500         C103        S  
12       0         A/5. 2151    8.0500          NaN        S  
13       5            347082   31.2750          NaN        S  
14       0            350406    7.8542          NaN        S  
15       0            248706   16.0000          NaN        S  
16       1            382652   29.1250          NaN        Q  
17       0            244373   13.0000          NaN        S  
18       0            345763   18.0000          NaN        S  
19       0              2649    7.2250          NaN        C  
20       0            239865   26.0000          NaN        S  
21       0            248698   13.0000          D56        S  
22       0            330923    8.0292          NaN        Q  
23       0            113788   35.5000           A6        S  
24       1            349909   21.0750          NaN        S  
25       5            347077   31.3875          NaN        S  
26       0              2631    7.2250          NaN        C  
27       2             19950  263.0000  C23 C25 C27        S  
28       0            330959    7.8792          NaN        Q  
29       0            349216    7.8958          NaN        S  
..     ...               ...       ...          ...      ...  
861      0             28134   11.5000          NaN        S  
862      0             17466   25.9292          D17        S  
863      2          CA. 2343   69.5500          NaN        S  
864      0            233866   13.0000          NaN        S  
865      0            236852   13.0000          NaN        S  
866      0     SC/PARIS 2149   13.8583          NaN        C  
867      0          PC 17590   50.4958          A24        S  
868      0            345777    9.5000          NaN        S  
869      1            347742   11.1333          NaN        S  
870      0            349248    7.8958          NaN        S  
871      1             11751   52.5542          D35        S  
872      0               695    5.0000  B51 B53 B55        S  
873      0            345765    9.0000          NaN        S  
874      0         P/PP 3381   24.0000          NaN        C  
875      0              2667    7.2250          NaN        C  
876      0              7534    9.8458          NaN        S  
877      0            349212    7.8958          NaN        S  
878      0            349217    7.8958          NaN        S  
879      1             11767   83.1583          C50        C  
880      1            230433   26.0000          NaN        S  
881      0            349257    7.8958          NaN        S  
882      0              7552   10.5167          NaN        S  
883      0  C.A./SOTON 34068   10.5000          NaN        S  
884      0   SOTON/OQ 392076    7.0500          NaN        S  
885      5            382652   29.1250          NaN        Q  
886      0            211536   13.0000          NaN        S  
887      0            112053   30.0000          B42        S  
888      2        W./C. 6607   23.4500          NaN        S  
889      0            111369   30.0000         C148        C  
890      0            370376    7.7500          NaN        Q  

[891 rows x 12 columns]
#+end_example

* Finding the missing data
+ 在 python 中的 Missing data 表示为 None
+ 在 Pandas 中的 Missing data 表示为 NaN
#+BEGIN_SRC ipython :session  
titanic_survival["Age"]
#+END_SRC

#+RESULTS:
#+begin_example
0      22
1      38
2      26
3      35
4      35
5     NaN
6      54
7       2
8      27
9      14
10      4
11     58
12     20
13     39
14     14
15     55
16      2
17    NaN
18     31
19    NaN
20     35
21     34
22     15
23     28
24      8
25     38
26    NaN
27     19
28    NaN
29    NaN
       ..
861    21
862    48
863   NaN
864    24
865    42
866    27
867    31
868   NaN
869     4
870    26
871    47
872    33
873    47
874    28
875    15
876    20
877    19
878   NaN
879    56
880    25
881    33
882    22
883    28
884    25
885    39
886    27
887    19
888   NaN
889    26
890    32
Name: Age, dtype: float64
#+end_example

#+BEGIN_SRC ipython :session  
age_null = pd.
* Use the apply function
isnull(titanic_survival["Age"])
age_null_true = age_null[age_null == True]
age_null_count = len(age_null_true)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC ipython :session  
age_null_count
#+END_SRC

#+RESULTS:
: 177

* Whats the big deal with missiong data
数据中缺失的数据会引起算平均数等一系列而产生误差。为了避免需要去除没有用的数据
#+BEGIN_SRC ipython :session  
mean_age = sum(titanic_survival["Age"]) / len(titanic_survival["Age"])
mean_age
#+END_SRC

#+RESULTS:
: nan

+ 用[[http://pandas.pydata.org/pandas-docs/stable/generated/pandas.isnull.html][pd.isnull]] 来找到 NaN 的数值也就是缺失的值
+ 在 age 的列中，去除 NaN 的值后，重新成为一个向量
+ 算出平均数
#+BEGIN_SRC ipython :session  
age_null = pd.isnull(titanic_survival["Age"])
age_null_false = titanic_survival["Age"][age_null == False]
correct_mean_age = sum(age_null_false) / len(age_null_false)
print(correct_mean_age)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC ipython :session  
correct_mean_age 
#+END_SRC

#+RESULTS:
: 29.69911764705882

* Easier ways to do math
用 mean() sum()等来计算
#+BEGIN_SRC ipython :session  
correct_mean_age = titanic_survival["Age"].mean()
correct_mean_fare = titanic_survival["Fare"].mean()
#+END_SRC

#+RESULTS:

* Computing summary statistics
#+BEGIN_SRC ipython :session :results output :exports both
passenger_classes = [1, 2, 3]
fares_by_class = {}
for pclass in passenger_classes:
    fare_for_class = None
    # Insert code here to compute the average fare for pclass
    # Assign the result to fare_for_class
    fares_by_class[pclass] = fare_for_class
    #print fare_for_class 
fares_by_class = {}
for pclass in passenger_classes:
    pclass_fares = titanic_survival["Fare"][titanic_survival["Pclass"] == pclass]
    fare_for_class = pclass_fares.mean()
    fares_by_class[pclass] = fare_for_class
    print fare_for_class
#+END_SRC

#+RESULTS:
: 84.1546875
: 20.6621831522
: 13.6755501018

* Making pivot tables
[[http://pandas.pydata.org/pandas-docs/stable/generated/pandas.pivot_table.html][pandas.pivot_table]]
计算每个乘客在泰坦尼克号上活下来的几率
#+BEGIN_SRC ipython :session 
import numpy as np
passenger_age = titanic_survival.pivot_table(index="Pclass", values="Age", aggfunc=np.mean)
passenger_survival = titanic_survival.pivot_table(index="Pclass", values="Survived", aggfunc=np.mean)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session
passenger_survival
#+END_SRC

#+RESULTS:
: Pclass
: 1    0.629630
: 2    0.472826
: 3    0.242363
: Name: Survived, dtype: float64

* More complex pivot tables
#+BEGIN_SRC ipython :session :results output :exports both
passenger_survival = titanic_survival.pivot_table(index="Pclass", values=["Age", "Survived"], aggfunc=np.mean)
print(passenger_survival)
port_stats = titanic_survival.pivot_table(index="Embarked", values=["Age", "Survived", "Fare"], aggfunc=np.mean)
print(port_stats)
#+END_SRC

#+RESULTS:
#+begin_example
              Age  Survived
Pclass                     
1       38.233441  0.629630
2       29.877630  0.472826
3       25.140620  0.242363
                Age       Fare  Survived
Embarked                                
C         30.814769  59.954144  0.553571
Q         28.089286  13.276030  0.389610
S         29.445397  27.079812  0.336957
#+end_example

* Drop missing values
[[http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html][pandas.DataFrame.dropna]]

#+BEGIN_SRC ipython :session :results output
new_titanic_survival = titanic_survival.dropna()

# It looks like we have an empty dataframe now.
# This is because every row has at least one missing value.
print(new_titanic_survival)
#+END_SRC

#+RESULTS:
#+begin_example
     PassengerId  Survived  Pclass  \
1              2         1       1   
3              4         1       1   
6              7         0       1   
10            11         1       3   
11            12         1       1   
21            22         1       2   
23            24         1       1   
27            28         0       1   
52            53         1       1   
54            55         0       1   
62            63         0       1   
66            67         1       2   
75            76         0       3   
88            89         1       1   
92            93         0       1   
96            97         0       1   
97            98         1       1   
102          103         0       1   
110          111         0       1   
118          119         0       1   
123          124         1       2   
124          125         0       1   
136          137         1       1   
137          138         0       1   
139          140         0       1   
148          149         0       2   
151          152         1       1   
170          171         0       1   
174          175         0       1   
177          178         0       1   
..           ...       ...     ...   
737          738         1       1   
741          742         0       1   
742          743         1       1   
745          746         0       1   
748          749         0       1   
751          752         1       3   
759          760         1       1   
763          764         1       1   
765          766         1       1   
772          773         0       2   
779          780         1       1   
781          782         1       1   
782          783         0       1   
789          790         0       1   
796          797         1       1   
802          803         1       1   
806          807         0       1   
809          810         1       1   
820          821         1       1   
823          824         1       3   
835          836         1       1   
853          854         1       1   
857          858         1       1   
862          863         1       1   
867          868         0       1   
871          872         1       1   
872          873         0       1   
879          880         1       1   
887          888         1       1   
889          890         1       1   

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1   
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1   
6                              McCarthy, Mr. Timothy J    male  54.0      0   
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1   
11                            Bonnell, Miss. Elizabeth  female  58.0      0   
21                               Beesley, Mr. Lawrence    male  34.0      0   
23                        Sloper, Mr. William Thompson    male  28.0      0   
27                      Fortune, Mr. Charles Alexander    male  19.0      3   
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)  female  49.0      1   
54                      Ostby, Mr. Engelhart Cornelius    male  65.0      0   
62                         Harris, Mr. Henry Birkhardt    male  45.0      1   
66                        Nye, Mrs. (Elizabeth Ramell)  female  29.0      0   
75                             Moen, Mr. Sigurd Hansen    male  25.0      0   
88                          Fortune, Miss. Mabel Helen  female  23.0      3   
92                         Chaffee, Mr. Herbert Fuller    male  46.0      1   
96                           Goldschmidt, Mr. George B    male  71.0      0   
97                     Greenfield, Mr. William Bertram    male  23.0      0   
102                          White, Mr. Richard Frasar    male  21.0      0   
110                     Porter, Mr. Walter Chamberlain    male  47.0      0   
118                           Baxter, Mr. Quigg Edmond    male  24.0      0   
123                                Webber, Miss. Susan  female  32.5      0   
124                        White, Mr. Percival Wayland    male  54.0      0   
136                       Newsom, Miss. Helen Monypeny  female  19.0      0   
137                        Futrelle, Mr. Jacques Heath    male  37.0      1   
139                                 Giglio, Mr. Victor    male  24.0      0   
148           Navratil, Mr. Michel ("Louis M Hoffman")    male  36.5      0   
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0      1   
170                          Van der hoef, Mr. Wyckoff    male  61.0      0   
174                            Smith, Mr. James Clinch    male  56.0      0   
177                         Isham, Miss. Ann Elizabeth  female  50.0      0   
..                                                 ...     ...   ...    ...   
737                             Lesurer, Mr. Gustave J    male  35.0      0   
741                      Cavendish, Mr. Tyrell William    male  36.0      1   
742              Ryerson, Miss. Susan Parker "Suzette"  female  21.0      2   
745                       Crosby, Capt. Edward Gifford    male  70.0      1   
748                          Marvin, Mr. Daniel Warner    male  19.0      1   
751                                Moor, Master. Meier    male   6.0      0   
759  Rothes, the Countess. of (Lucy Noel Martha Dye...  female  33.0      0   
763          Carter, Mrs. William Ernest (Lucile Polk)  female  36.0      1   
765               Hogeboom, Mrs. John C (Anna Andrews)  female  51.0      1   
772                                  Mack, Mrs. (Mary)  female  57.0      0   
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  female  43.0      0   
781          Dick, Mrs. Albert Adrian (Vera Gillespie)  female  17.0      1   
782                             Long, Mr. Milton Clyde    male  29.0      0   
789                           Guggenheim, Mr. Benjamin    male  46.0      0   
796                        Leader, Dr. Alice (Farnham)  female  49.0      0   
802                Carter, Master. William Thornton II    male  11.0      1   
806                             Andrews, Mr. Thomas Jr    male  39.0      0   
809     Chambers, Mrs. Norman Campbell (Bertha Griggs)  female  33.0      1   
820  Hays, Mrs. Charles Melville (Clara Jennings Gr...  female  52.0      1   
823                                 Moor, Mrs. (Beila)  female  27.0      0   
835                        Compton, Miss. Sara Rebecca  female  39.0      1   
853                          Lines, Miss. Mary Conover  female  16.0      0   
857                             Daly, Mr. Peter Denis     male  51.0      0   
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0   
867               Roebling, Mr. Washington Augustus II    male  31.0      0   
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1   
872                           Carlsson, Mr. Frans Olof    male  33.0      0   
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0   
887                       Graham, Miss. Margaret Edith  female  19.0      0   
889                              Behr, Mr. Karl Howell    male  26.0      0   

     Parch       Ticket      Fare            Cabin Embarked  
1        0     PC 17599   71.2833              C85        C  
3        0       113803   53.1000             C123        S  
6        0        17463   51.8625              E46        S  
10       1      PP 9549   16.7000               G6        S  
11       0       113783   26.5500             C103        S  
21       0       248698   13.0000              D56        S  
23       0       113788   35.5000               A6        S  
27       2        19950  263.0000      C23 C25 C27        S  
52       0     PC 17572   76.7292              D33        C  
54       1       113509   61.9792              B30        C  
62       0        36973   83.4750              C83        S  
66       0   C.A. 29395   10.5000              F33        S  
75       0       348123    7.6500            F G73        S  
88       2        19950  263.0000      C23 C25 C27        S  
92       0  W.E.P. 5734   61.1750              E31        S  
96       0     PC 17754   34.6542               A5        C  
97       1     PC 17759   63.3583          D10 D12        C  
102      1        35281   77.2875              D26        S  
110      0       110465   52.0000             C110        S  
118      1     PC 17558  247.5208          B58 B60        C  
123      0        27267   13.0000             E101        S  
124      1        35281   77.2875              D26        S  
136      2        11752   26.2833              D47        S  
137      0       113803   53.1000             C123        S  
139      0     PC 17593   79.2000              B86        C  
148      2       230080   26.0000               F2        S  
151      0       113776   66.6000               C2        S  
170      0       111240   33.5000              B19        S  
174      0        17764   30.6958               A7        C  
177      0     PC 17595   28.7125              C49        C  
..     ...          ...       ...              ...      ...  
737      0     PC 17755  512.3292             B101        C  
741      0        19877   78.8500              C46        S  
742      2     PC 17608  262.3750  B57 B59 B63 B66        C  
745      1    WE/P 5735   71.0000              B22        S  
748      0       113773   53.1000              D30        S  
751      1       392096   12.4750             E121        S  
759      0       110152   86.5000              B77        S  
763      2       113760  120.0000          B96 B98        S  
765      0        13502   77.9583              D11        S  
772      0  S.O./P.P. 3   10.5000              E77        S  
779      1        24160  211.3375               B3        S  
781      0        17474   57.0000              B20        S  
782      0       113501   30.0000               D6        S  
789      0     PC 17593   79.2000          B82 B84        C  
796      0        17465   25.9292              D17        S  
802      2       113760  120.0000          B96 B98        S  
806      0       112050    0.0000              A36        S  
809      0       113806   53.1000               E8        S  
820      1        12749   93.5000              B69        S  
823      1       392096   12.4750             E121        S  
835      1     PC 17756   83.1583              E49        C  
853      1     PC 17592   39.4000              D28        S  
857      0       113055   26.5500              E17        S  
862      0        17466   25.9292              D17        S  
867      0     PC 17590   50.4958              A24        S  
871      1        11751   52.5542              D35        S  
872      0          695    5.0000      B51 B53 B55        S  
879      1        11767   83.1583              C50        C  
887      0       112053   30.0000              B42        S  
889      0       111369   30.0000             C148        C  

[183 rows x 12 columns]
#+end_example

用 axis 这个参数来扔掉“列”上缺失的值
#+BEGIN_SRC ipython :session  
new_titanic_survival1 = titanic_survival.dropna(axis=1)
print(new_titanic_survival)
#+End_SRC

#+RESULTS:

或者扔掉某些列上缺失的值 subset=["age", "sex"]
#+BEGIN_SRC ipython :session  
new_titanic_survival = titanic_survival.dropna(subset=["Age", "Sex"])
print(new_titanic_survival)
#+END_SRC

#+RESULTS:

* Row indices
#+BEGIN_SRC ipython :session  
print(titanic_survival.iloc[:4,:])
#+END_SRC

#+RESULTS:

* Column indices
#+BEGIN_SRC ipython :session  
new_titanic_survival = titanic_survival.dropna(subset=["Sex"])
row_25_survived = new_titanic_survival.loc[25, "Survived"]
print (row_25_survived)
print(new_titanic_survival)
#+END_SRC

#+RESULTS:

* TODO Reindex rows
  DEADLINE: <2016-03-10 Thu> SCHEDULED: <2016-03-10 Thu>
#+BEGIN_SRC ipython :session  
new_titanic_survival = new_titanic_survival.reset_index(drop=True)
# Now we have indexes starting from 0!
print(new_titanic_survival)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session  
new_titanic_survival = titanic_survival.dropna(subset=["Age", "Sex"])
print(new_titanic_survival)
titanic_reindexed = new_titanic_survival.reset_index(drop=True)
#print(titanic_reindexed)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session 
titanic_reindexed
#+END_SRC

#+RESULTS:
#+begin_example
     PassengerId  Survived  Pclass  \
0              1         0       3   
1              2         1       1   
2              3         1       3   
3              4         1       1   
4              5         0       3   
5              7         0       1   
6              8         0       3   
7              9         1       3   
8             10         1       2   
9             11         1       3   
10            12         1       1   
11            13         0       3   
12            14         0       3   
13            15         0       3   
14            16         1       2   
15            17         0       3   
16            19         0       3   
17            21         0       2   
18            22         1       2   
19            23         1       3   
20            24         1       1   
21            25         0       3   
22            26         1       3   
23            28         0       1   
24            31         0       1   
25            34         0       2   
26            35         0       1   
27            36         0       1   
28            38         0       3   
29            39         0       3   
..           ...       ...     ...   
684          857         1       1   
685          858         1       1   
686          859         1       3   
687          861         0       3   
688          862         0       2   
689          863         1       1   
690          865         0       2   
691          866         1       2   
692          867         1       2   
693          868         0       1   
694          870         1       3   
695          871         0       3   
696          872         1       1   
697          873         0       1   
698          874         0       3   
699          875         1       2   
700          876         1       3   
701          877         0       3   
702          878         0       3   
703          880         1       1   
704          881         1       2   
705          882         0       3   
706          883         0       3   
707          884         0       2   
708          885         0       3   
709          886         0       3   
710          887         0       2   
711          888         1       1   
712          890         1       1   
713          891         0       3   

                                                  Name     Sex  Age  SibSp  \
0                              Braund, Mr. Owen Harris    male   22      1   
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38      1   
2                               Heikkinen, Miss. Laina  female   26      0   
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35      1   
4                             Allen, Mr. William Henry    male   35      0   
5                              McCarthy, Mr. Timothy J    male   54      0   
6                       Palsson, Master. Gosta Leonard    male    2      3   
7    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female   27      0   
8                  Nasser, Mrs. Nicholas (Adele Achem)  female   14      1   
9                      Sandstrom, Miss. Marguerite Rut  female    4      1   
10                            Bonnell, Miss. Elizabeth  female   58      0   
11                      Saundercock, Mr. William Henry    male   20      0   
12                         Andersson, Mr. Anders Johan    male   39      1   
13                Vestrom, Miss. Hulda Amanda Adolfina  female   14      0   
14                    Hewlett, Mrs. (Mary D Kingcome)   female   55      0   
15                                Rice, Master. Eugene    male    2      4   
16   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female   31      1   
17                                Fynney, Mr. Joseph J    male   35      0   
18                               Beesley, Mr. Lawrence    male   34      0   
19                         McGowan, Miss. Anna "Annie"  female   15      0   
20                        Sloper, Mr. William Thompson    male   28      0   
21                       Palsson, Miss. Torborg Danira  female    8      3   
22   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female   38      1   
23                      Fortune, Mr. Charles Alexander    male   19      3   
24                            Uruchurtu, Don. Manuel E    male   40      0   
25                               Wheadon, Mr. Edward H    male   66      0   
26                             Meyer, Mr. Edgar Joseph    male   28      1   
27                      Holverson, Mr. Alexander Oskar    male   42      1   
28                            Cann, Mr. Ernest Charles    male   21      0   
29                  Vander Planke, Miss. Augusta Maria  female   18      2   
..                                                 ...     ...  ...    ...   
684         Wick, Mrs. George Dennick (Mary Hitchcock)  female   45      1   
685                             Daly, Mr. Peter Denis     male   51      0   
686              Baclini, Mrs. Solomon (Latifa Qurban)  female   24      0   
687                            Hansen, Mr. Claus Peter    male   41      2   
688                        Giles, Mr. Frederick Edward    male   21      1   
689  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female   48      0   
690                             Gill, Mr. John William    male   24      0   
691                           Bystrom, Mrs. (Karolina)  female   42      0   
692                       Duran y More, Miss. Asuncion  female   27      1   
693               Roebling, Mr. Washington Augustus II    male   31      0   
694                    Johnson, Master. Harold Theodor    male    4      1   
695                                  Balkic, Mr. Cerin    male   26      0   
696   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female   47      1   
697                           Carlsson, Mr. Frans Olof    male   33      0   
698                        Vander Cruyssen, Mr. Victor    male   47      0   
699              Abelson, Mrs. Samuel (Hannah Wizosky)  female   28      1   
700                   Najib, Miss. Adele Kiamie "Jane"  female   15      0   
701                      Gustafsson, Mr. Alfred Ossian    male   20      0   
702                               Petroff, Mr. Nedelio    male   19      0   
703      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female   56      0   
704       Shelley, Mrs. William (Imanita Parrish Hall)  female   25      0   
705                                 Markun, Mr. Johann    male   33      0   
706                       Dahlberg, Miss. Gerda Ulrika  female   22      0   
707                      Banfield, Mr. Frederick James    male   28      0   
708                             Sutehall, Mr. Henry Jr    male   25      0   
709               Rice, Mrs. William (Margaret Norton)  female   39      0   
710                              Montvila, Rev. Juozas    male   27      0   
711                       Graham, Miss. Margaret Edith  female   19      0   
712                              Behr, Mr. Karl Howell    male   26      0   
713                                Dooley, Mr. Patrick    male   32      0   

     Parch            Ticket      Fare        Cabin Embarked  
0        0         A/5 21171    7.2500          NaN        S  
1        0          PC 17599   71.2833          C85        C  
2        0  STON/O2. 3101282    7.9250          NaN        S  
3        0            113803   53.1000         C123        S  
4        0            373450    8.0500          NaN        S  
5        0             17463   51.8625          E46        S  
6        1            349909   21.0750          NaN        S  
7        2            347742   11.1333          NaN        S  
8        0            237736   30.0708          NaN        C  
9        1           PP 9549   16.7000           G6        S  
10       0            113783   26.5500         C103        S  
11       0         A/5. 2151    8.0500          NaN        S  
12       5            347082   31.2750          NaN        S  
13       0            350406    7.8542          NaN        S  
14       0            248706   16.0000          NaN        S  
15       1            382652   29.1250          NaN        Q  
16       0            345763   18.0000          NaN        S  
17       0            239865   26.0000          NaN        S  
18       0            248698   13.0000          D56        S  
19       0            330923    8.0292          NaN        Q  
20       0            113788   35.5000           A6        S  
21       1            349909   21.0750          NaN        S  
22       5            347077   31.3875          NaN        S  
23       2             19950  263.0000  C23 C25 C27        S  
24       0          PC 17601   27.7208          NaN        C  
25       0        C.A. 24579   10.5000          NaN        S  
26       0          PC 17604   82.1708          NaN        C  
27       0            113789   52.0000          NaN        S  
28       0        A./5. 2152    8.0500          NaN        S  
29       0            345764   18.0000          NaN        S  
..     ...               ...       ...          ...      ...  
684      1             36928  164.8667          NaN        S  
685      0            113055   26.5500          E17        S  
686      3              2666   19.2583          NaN        C  
687      0            350026   14.1083          NaN        S  
688      0             28134   11.5000          NaN        S  
689      0             17466   25.9292          D17        S  
690      0            233866   13.0000          NaN        S  
691      0            236852   13.0000          NaN        S  
692      0     SC/PARIS 2149   13.8583          NaN        C  
693      0          PC 17590   50.4958          A24        S  
694      1            347742   11.1333          NaN        S  
695      0            349248    7.8958          NaN        S  
696      1             11751   52.5542          D35        S  
697      0               695    5.0000  B51 B53 B55        S  
698      0            345765    9.0000          NaN        S  
699      0         P/PP 3381   24.0000          NaN        C  
700      0              2667    7.2250          NaN        C  
701      0              7534    9.8458          NaN        S  
702      0            349212    7.8958          NaN        S  
703      1             11767   83.1583          C50        C  
704      1            230433   26.0000          NaN        S  
705      0            349257    7.8958          NaN        S  
706      0              7552   10.5167          NaN        S  
707      0  C.A./SOTON 34068   10.5000          NaN        S  
708      0   SOTON/OQ 392076    7.0500          NaN        S  
709      5            382652   29.1250          NaN        Q  
710      0            211536   13.0000          NaN        S  
711      0            112053   30.0000          B42        S  
712      0            111369   30.0000         C148        C  
713      0            370376    7.7500          NaN        Q  

[714 rows x 12 columns]
#+end_example

* Use the apply function
[[http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.apply.html][pandas.DataFrame.apply]]

#+BEGIN_SRC ipython :session  
# This function counts the number of null values in a series
def null_count(column):
    # Make a vector that contains True if null, False if not.
    column_null = pd.isnull(column)
    # Create a new vector with only values where the series is null.
    null = column[column_null == True]
    # Return the count of null values.
    return len(null)

# Compute null counts for each column
column_null_count = titanic_survival.apply(null_count)
print(column_null_count)
def not_null_count(column):
    column_null = pd.isnull(column)
    not_null = column[column_null == False]
    return len(not_null)
column_not_null_count = titanic_survival.apply(not_null_count)
#+END_SRC

#+RESULTS:

* Applying a function to a row
用 axis 这个参数能通过.apply()迭代“行”

#+BEGIN_SRC ipython :session  
# This function will check if a row is an entry for a minor (under 18), or not.
def is_minor(row):
    if row["Age"] < 18:
        return True
    else:
        return False

# This is a boolean series with the same length as the number of rows in titanic_survival
# Each entry is True if the row at the same position is a record for a minor
# The axis of 1 specifies that it will iterate over rows, not columns
minors = titanic_survival.apply(is_minor, axis=1)

def generate_age_label(row):
    age = row["Age"]
    if pd.isnull(age):
        return "unknown"
    elif age < 18:
        return "minor"
    else:
        return "adult"

age_labels = titanic_survival.apply(generate_age_label, axis=1)
np.
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session  
age_labels
#+END_SRC

#+RESULTS:
#+begin_example
0        adult
1        adult
2        adult
3        adult
4        adult
5      unknown
6        adult
7        minor
8        adult
9        minor
10       minor
11       adult
12       adult
13       adult
14       minor
15       adult
16       minor
17     unknown
18       adult
19     unknown
20       adult
21       adult
22       minor
23       adult
24       minor
25       adult
26     unknown
27       adult
28     unknown
29     unknown
        ...   
861      adult
862      adult
863    unknown
864      adult
865      adult
866      adult
867      adult
868    unknown
869      minor
870      adult
871      adult
872      adult
873      adult
874      adult
875      minor
876      adult
877      adult
878    unknown
879      adult
880      adult
881      adult
882      adult
883      adult
884      adult
885      adult
886      adult
887      adult
888    unknown
889      adult
890      adult
dtype: object
#+end_example

* Computing survival percentage by age group
#+BEGIN_SRC ipython :session  
#  meage_group_survival =  titanic_survival.pivot_table(index = "age_labels", values = ["survived"], aggfunc = np.mean)
#+END_SRC

